Перем ИмяПровайдера;
Перем ПутьКФайлуФлагов;
Перем ИмяДомена;

&Желудь
Процедура ПриСозданииОбъекта(
	&Деталька(Значение = "openfeature.Провайдер", ЗначениеПоУмолчанию = "memory") _Провайдер,
	&Деталька(Значение = "openfeature.ПутьКФайлу", ЗначениеПоУмолчанию = "flags.json") _ПутьКФайлу,
	&Деталька(Значение = "openfeature.Домен", ЗначениеПоУмолчанию = "") _Домен)

	ИмяПровайдера = НРег(СокрЛП(Строка(_Провайдер)));
	ПутьКФайлуФлагов = Строка(_ПутьКФайлу);
	ИмяДомена = Строка(_Домен);

КонецПроцедуры

// Вид провайдера: json, memory или none.
//
// Возвращаемое значение:
//   Строка - идентификатор провайдера.
//
Функция Провайдер() Экспорт

	Возврат ИмяПровайдера;

КонецФункции

// Путь к файлу с описанием флагов для провайдера json.
//
// Возвращаемое значение:
//   Строка - путь к файлу.
//
Функция ПутьКФайлу() Экспорт

	Возврат ПутьКФайлуФлагов;

КонецФункции

// Домен, с которым создаётся клиент.
//
// Возвращаемое значение:
//   Строка - имя домена либо пустая строка.
//
Функция Домен() Экспорт

	Возврат ИмяДомена;

КонецФункции
